labelling = {"부품 외관_실밥터짐/돌출": 1, "부품 외관_굴곡/변형/고착": 1, "부품 외관_트림 벌어짐/간섭": 1, "부품 외관_파손/긁힘": 1,
             "부품 외관_가죽 주름/들뜸": 1, "부품 외관_투입물 고정/장착 불량": 1, "부품 외관_얼보임, 유막현상": 1,

             "시트 작동불량_전후진": 2, "시트 작동불량_허리지지대": 2, "시트 작동불량_각도조절/폴딩시": 2,
             "시트 작동불량_메모리시트": 2, "시트 작동불량_냉방/통풍 조절": 2, "시트 작동불량_난방/열선 조절": 2,
             "시트 작동불량_높낮이": 2, "시트 작동불량_암레스트": 2, "시트벨트 작동불량_높낮이 작동불량": 2,
             "시트벨트 작동불량_체결/해체 어려움": 2,

             "시트 작동 소음/이음_허리지지대": 3, "시트 작동 소음/이음_전후진": 3, "시트 작동 소음/이음_냉방조절": 3,
             "시트 작동 소음/이음_각도조절/폴딩시": 3, "시트 작동 소음/이음_높낮이": 3, "시트 작동 소음/이음_착좌시": 3,

             "작동불량_작동이 원활하지 않음(무거움)": 4, "작동불량_작동안됨": 4, "작동불량_오작동": 4,
             "작동불량_작동이 쉽게 됨(가벼움)": 4,

             "경고등 점등_경고등 점등-에어백/SRS": 5, "경고등 점등_경고등 점등": 5, "경고등 점등_경고등 점등-시트벨트": 5,
             "경고등 점등_경고등 점등안됨": 5, "경고등 점등_경고등 점등-ABS": 5, "경고등 점등_경고등 점등-엔진": 5,

             "소음/이음_공회전시": 6, "소음/이음_주행중": 6, "소음/이음_요철로/둔턱": 6, "소음/이음_작동시": 6,
             "소음/이음_가/감속시": 6, "소음/이음_개폐시": 6, "소음/이음_정차시": 6, "엔진 소음/이음_주행중": 6,

             "녹 발생_관통부식": 7, "녹 발생_녹발생": 7,

             "진동/떨림_주행중": 8, "차체 진동/떨림_주행중": 8, "도어 진동/떨림_주행중": 8,

             "냄새과다_실내발생": 9, "냄새과다_배기가스": 9,

             "조립 문제_미장착/오장착": 10, "조립 문제_들뜸/떨어짐": 10, "조립 문제_고정작업 불량(이탈)": 10,
             "조립 문제_정위치 불량": 10, "조립 문제_유격/유동": 10, "조립 문제_간/단차": 10, "조립 문제_이종품 장착": 10,
             "조립 문제_코딩불량": 10, "조립 문제_조정불량": 10, "조립 문제_치합불량": 10,

             "사용/위치불편_승차감 불만": 11, "사용/위치불편_위치불편": 11, "사용/위치불편_각도불만": 11,
             "사용/위치불편_워닝 음량/음색 불만": 11, "사용/위치불편_시인성불만": 11, "사용/위치불편_작동무거음": 11,
             "사용/위치불편_조작어려움": 11, "사용/위치불편_작동거리짧음": 11, "사용/위치불편_간격협소": 11,

             "기타": 12, "막힘_상시": 12, "오디오/AVN 주변장치_USB작동불량": 12, "공조 불량_에어컨 시원해지지 않음": 12,
             "충/방전 불량_방전": 12, "과열_간헐적": 12,

             "부품 도장_변색/벗겨짐": 13, "부품 도장_도금 박리/불량": 13, "부품 도장_오염/분진": 13,

             "도어 개폐불량_개폐어려움": 14, "도어 개폐불량_개폐안됨": 14,

             "기밀 불량_이물질 유입": 15, "기밀 불량_습기": 15, "기밀 불량_누기": 15
             }

big_category = {1: "부품 외관", 2: "시트 작동불량 / 시트벨트_작동불량", 3: "시트 작동 소음/이음", 4: "작동 불량",
                5: "경고등 점등", 6: "소음/이음", 7: "녹 발생", 8: "진동", 9: "냄새과다", 10: "조립문제", 11: "사용/위치 불편",
                12: "기타", 13: "부품 도장", 14: "도어 개폐불량", 15: "기밀 불량"}
